ЧартерEDT.Расширение1/src/InformationRegisters/чартер_ЗаписьНаРейс/чартер_ЗаписьНаРейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>чартер_ЗаписьНаРейс</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусНаРейсе</name>
    <type>
      <types>EnumRef.чартер_СтатусыНаРейсе</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйБагаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныВылета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SLIP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКакойНОТеЗаявлены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.чартер_Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.чартер_Рейсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.чартер_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.чартер_ПосадочныеМестаНаРейс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЧартерEDT.Расширение1/src/Enums/чартер_СтатусыНаРейсе/чартер_СтатусыНаРейсе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>чартер_СтатусыНаРейсе</name>
  <enumValues>
    <name>ЗаписанНаРейс</name>
  </enumValues>
  <enumValues>
    <name>ЗаписьУдалена</name>
  </enumValues>
  <enumValues>
    <name>ЗаписьПеренесенаНаДругойРейс</name>
  </enumValues>
</mdclass:Enum>

ЧартерEDT.Расширение1/src/Catalogs/чартер_Рейсы/чартер_Рейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>чартер_Рейсы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКвотаНаОрганизацию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПерелета</name>
    <type>
      <types>CatalogRef.чартер_МаршрутыПерелета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПолета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВС</name>
    <type>
      <types>EnumRef.чартер_ТипВСРассадка</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортРейсаЗагружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БортСформирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Квотирование</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.чартер_Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>КвотаНаРейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЧартерEDT.Расширение1/src/InformationRegisters/чартер_ЗаписьНаРейс/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить всех зарегистрированных на рейс.
// для групповой печати посадочных талонов (по сути это главная процедура)
// 
// Параметры:
//  ШаблонБилета - ТабличныйДокумент
//  Параметры - Структура
Процедура ПолучитьВсехЗарегистрированныхНаРейс(ШаблонБилета, Параметры) Экспорт
	
	ШаблонБилета.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаВыборкиРегистрации();	
		
	Запрос.УстановитьПараметр("Рейс", Параметры.Рейс);
			 
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщение = СтрШаблон("На рейсе %1 пока нет забронированных мест", Параметры.Рейс);
		чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю(Сообщение);
		Возврат;
	Иначе	
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Макет = ПолучитьОбщийМакет(чартеры_ОбщиеПроцедурыИФункцииСервер.ПолучитьШаблонПосадочногоТалона(Выборка.КлассМеста));
			ОбластьДанных = Макет.ПолучитьОбласть("Билет");
			ЗаполнитьЗначенияСвойств(ОбластьДанных.Параметры, Выборка);
			ШаблонБилета.Вывести(ОбластьДанных);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗапросаВыборкиРегистрации()
	
	ТестЗапроса = "ВЫБРАТЬ
	|	чартер_ЗаписьНаРейс.Организация КАК Организация,
	|	чартер_ЗаписьНаРейс.ФИО КАК ФИО,
	|	чартер_ЗаписьНаРейс.ФИОАнглийское КАК ФИОАнглийское,
	|	чартер_ЗаписьНаРейс.Место КАК Место,
	|	чартер_ЗаписьНаРейс.Рейс КАК Рейс,
	|	чартер_ЗаписьНаРейс.ДополнительныйБагаж КАК ДополнительныйБагаж,
	|	чартер_ЗаписьНаРейс.Место.Класс КАК КлассМеста
	|ПОМЕСТИТЬ втРегистрацияСотрудника
	|ИЗ
	|	РегистрСведений.чартер_ЗаписьНаРейс КАК чартер_ЗаписьНаРейс
	|ГДЕ
	|	чартер_ЗаписьНаРейс.Рейс = &Рейс
	|	И чартер_ЗаписьНаРейс.СтатусНаРейсе = ЗНАЧЕНИЕ(Перечисление.чартер_СтатусыНаРейсе.ЗаписанНаРейс)
	|	И НЕ чартер_ЗаписьНаРейс.Место = ЗНАЧЕНИЕ(Справочник.чартер_ПосадочныеМестаНаРейс.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	чартер_Рейсы.Наименование КАК Наименование,
	|	чартер_Рейсы.ДатаРейса КАК ДатаРейса,
	|	чартер_Рейсы.МаршрутПерелета КАК МаршрутПерелета,
	|	СТРОКА(чартер_Рейсы.Багаж) + "" кг"" КАК Багаж,
	|	чартер_Рейсы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втРейс
	|ИЗ
	|	Справочник.чартер_Рейсы КАК чартер_Рейсы
	|ГДЕ
	|	чартер_Рейсы.Ссылка = &Рейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРегистацияСотрудника.Организация.Представление КАК Организация,
	|	втРегистацияСотрудника.ФИО КАК ФИО,
	|	втРегистацияСотрудника.ФИОАнглийское КАК ФИОАнглийское,
	|	втРейс.ДатаРейса КАК ДатаРейса,
	|	втРейс.МаршрутПерелета.Представление КАК Маршрут,
	|	ВЫБОР
	|		КОГДА втРегистацияСотрудника.ДополнительныйБагаж
	|			ТОГДА втРейс.Багаж + ""х 2""
	|		ИНАЧЕ втРейс.Багаж
	|	КОНЕЦ КАК Багаж,
	|	втРегистацияСотрудника.Место.Представление КАК Место,
	|	втРейс.Наименование КАК НомерРейса,
	|	втРегистацияСотрудника.ДополнительныйБагаж КАК ДополнительныйБагаж,
	|	втРегистацияСотрудника.КлассМеста КАК КлассМеста
	|ИЗ
	|	втРегистрацияСотрудника КАК втРегистацияСотрудника
	|		ПОЛНОЕ СОЕДИНЕНИЕ втРейс КАК втРейс
	|		ПО втРегистацияСотрудника.Рейс = втРейс.Ссылка
	|ГДЕ
	|	НЕ втРегистацияСотрудника.Место = НЕОПРЕДЕЛЕНО";
	
	Возврат ТестЗапроса;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
